{
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 640,
  "initializer_range": 0.02,
  "intermediate_size": 2560,
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 128,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 2,
  "num_hidden_layers": 10,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 640,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": true,
  "relative_attention": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 128100
}
